In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("../adv_python/pandas/Files/customer.csv",names=["id","fname","lname","age","prof","loc"])
df.head()

        id     fname    lname  age                        prof     loc
0  4000001  Kristina    Chung   55                       Pilot   india
1  4000002     Paige     Chen   74                     Teacher      uk
2  4000003    Sherri   Melton   34                 Firefighter      us
3  4000004  Gretchen     Hill   66  Computer hardware engineer   china
4  4000005     Karen  Puckett   74                      Lawyer  africa

### 1. Find Row count

In [3]:
df.count()

id       463
fname    463
lname    463
age      463
prof     463
loc      462
dtype: int64

### 2. Remove duplicates rows and find total row count

In [4]:
df1=df.drop_duplicates()
df1.shape

(463, 6)

### 3. Age maximum 10 fname,lname,prof,loc

In [5]:
df1=df.sort_values(by="age",ascending=False)[["fname","lname","prof","loc"]].head(10)
df1

        fname     lname                     prof        loc
88     Sherri    Sutton            Social worker         us
324      Ruth    Harmon                   Artist  australia
391      Emma     Olson                    Pilot    ireland
258  Margaret   Burgess            Social worker     africa
306     Karen  Clements                   Farmer  australia
241      Edna     Hoyle      Electrical engineer     africa
1       Paige      Chen                  Teacher         uk
219   Rebecca     Heath  Environmental scientist     africa
361     Holly       Fox                Physicist  australia
274  Lawrence     Miles                   Dancer     africa

### 4. Age minimum 5 employees fname,lname,prof,loc

In [6]:
df1=df.sort_values(by="age")[["fname","lname","prof","loc"]].head(5)
df1

       fname      lname            prof        loc
175  Kristin  Alexander           Coach      china
289     Gail  Whitehead           Nurse  australia
348  Russell     Dalton  Civil engineer  australia
291    Donna       Rice   Social worker  australia
51   Shirley    Merritt        Reporter         uk

### 5. Each location count [count desc order]

In [7]:
df1=df.groupby(by="loc")["loc"].count().sort_values(ascending=False)
df1

loc
australia    104
africa        89
us            78
ireland       77
china         56
uk            37
india         21
Name: loc, dtype: int64

### 6. Full data

In [8]:
df1=df.loc[df["loc"]=="australia"]
df1

          id      fname      lname  age               prof        loc
5    4000006    Patrick       Song   42       Veterinarian  australia
284  4000285      Donna     Lehman   71      Social worker  australia
285  4000286  Catherine   Sherrill   48              Nurse  australia
286  4000287     Lester       Cash   30        Firefighter  australia
287  4000288      Jacob    Pittman   34          Economist  australia
..       ...        ...        ...  ...                ...        ...
382  4000383     Arnold      Burke   70           Reporter  australia
383  4000384    Melanie    Ritchie   36  Financial analyst  australia
384  4000385     Ronald       Odom   49       Psychologist  australia
385  4000386       Gene     Pearce   30          Architect  australia
386  4000387      Peter  Rosenberg   60         Politician  australia

[104 rows x 6 columns]

### 7. Each age group count [age desc order]

In [9]:
df1=df.groupby(by="age")["age"].count().sort_index(ascending=False)
df1

age
75     2
74    12
73    13
72    10
71     6
70    15
69    10
68     3
67    16
66    11
65    11
64    13
63     9
62     8
61     9
60     4
59    14
58     9
57     6
56     7
55     7
54    12
53     7
52    10
51    11
50     9
49     4
48     5
47     5
46     3
45    10
44     9
43     9
42     8
41     6
40    10
39     9
38     8
37    11
36    11
35    12
34    13
33     7
32     7
31    10
30     6
29     3
28    10
27    10
26     8
25     6
24     4
23     4
22     5
21     6
Name: age, dtype: int64

### 8. Each profession count [count desc order]

In [10]:
df1=df.groupby(by="prof")["prof"].count().sort_values(ascending=False)
df1

prof
Childcare worker                   17
Photographer                       15
Musician                           15
Loan officer                       14
Pilot                              13
Veterinarian                       13
Doctor                             13
Computer support specialist        12
Actor                              12
Civil engineer                     11
Politician                         11
Statistician                       11
Electrical engineer                11
Carpenter                          10
Environmental scientist            10
Social worker                      10
Lawyer                             10
Economist                          10
Human resources assistant          10
Nurse                               9
Recreation and fitness worker       9
Accountant                          9
Firefighter                         9
Athlete                             9
Engineering technician              9
Agricultural and food scientist     9
Designer                            9
Dancer                              9
Coach                               9
Farmer                              8
Electrician                         8
Librarian                           8
Therapist                           8
Architect                           8
Pharmacist                          8
Physicist                           8
Artist                              8
Secretary                           8
Reporter                            8
Police officer                      7
Computer hardware engineer          7
Computer software engineer          7
Real estate agent                   6
Automotive mechanic                 6
Chemist                             6
Judge                               6
Psychologist                        5
Teacher                             5
Writer                              5
Financial analyst                   4
africa                              1
Name: prof, dtype: int64

### 9. India work

In [11]:
df1=df.loc[df["loc"]=="india"]
df1.head(4)

        id     fname       lname  age       prof    loc
0  4000001  Kristina       Chung   55      Pilot  india
7  4000008     Hazel      Bender   63  Carpenter  india
8  4000009   Malcolm      Wagner   39     Artist  india
9  4000010   Dolores  McLaughlin   60     Writer  india

###### A. Row count

In [12]:
df1.count()

id       21
fname    21
lname    21
age      21
prof     21
loc      21
dtype: int64

###### B. Each profession count [count desc order]

In [13]:
df2=df1.groupby(by="prof")["prof"].count().sort_values(ascending=False)
df2

prof
Carpenter                      3
Musician                       3
Writer                         2
Accountant                     1
Artist                         1
Childcare worker               1
Computer support specialist    1
Dancer                         1
Doctor                         1
Engineering technician         1
Environmental scientist        1
Financial analyst              1
Lawyer                         1
Pharmacist                     1
Pilot                          1
Therapist                      1
Name: prof, dtype: int64

###### C. Age mxm 3 employees fname,lname,age,prof

In [14]:
df2=df1.sort_values(by="age",ascending=False)[["fname","lname","age","prof"]].head(3)
df2

      fname     lname  age                         prof
16     Neal  Lawrence   72  Computer support specialist
19  Crystal    Powers   67       Engineering technician
21     Eric    Steele   66                       Doctor

###### D. Age minimum 3 employees fname,lname,age,prof

In [15]:
df2=df1.sort_values(by="age")[["fname","lname","age","prof"]].head(3)
df2

       fname    lname  age    prof
11     Sandy   Raynor   26  Writer
25    Marian  Solomon   27  Lawyer
23  Franklin     Vick   28  Dancer

###### E. age above 40 full data

In [16]:
df2=df1.loc[df["age"]>40]
df2

         id     fname       lname  age                         prof    loc
0   4000001  Kristina       Chung   55                        Pilot  india
7   4000008     Hazel      Bender   63                    Carpenter  india
9   4000010   Dolores  McLaughlin   60                       Writer  india
10  4000011   Francis    McNamara   47                    Therapist  india
12  4000013    Marion        Moon   41                    Carpenter  india
13  4000014      Beth     Woodard   65                     Musician  india
14  4000015     Julia       Desai   49                     Musician  india
15  4000016    Jerome     Wallace   52                   Pharmacist  india
16  4000017      Neal    Lawrence   72  Computer support specialist  india
17  4000018      Jean     Griffin   45             Childcare worker  india
18  4000019  Kristine   Dougherty   63            Financial analyst  india
19  4000020   Crystal      Powers   67       Engineering technician  india
21  4000022      Eric      Steele   66                       Doctor  india
22  4000023    Wesley      Teague   42                    Carpenter  india
24  4000025    Claire   Gallagher   42                     Musician  india
26  4000027    Marcia       Walsh   64                   Accountant  india

###### F. age range 30 to 40 [profession count]

In [17]:
df2=df1.loc[(df1.age>=30)&(df1.age<=40) ].groupby(by="prof")["prof"].count()
df2

prof
Artist                     1
Environmental scientist    1
Name: prof, dtype: int64

### 10. us work

In [18]:
df1=df.loc[df["loc"]=="us"]
df1.head(5)

         id   fname    lname  age                         prof loc
2   4000003  Sherri   Melton   34                  Firefighter  us
63  4000064  Calvin     Diaz   65                      Athlete  us
64  4000065  Eugene   Graham   52               Police officer  us
65  4000066  Vickie  Watkins   55  Computer support specialist  us
66  4000067    Luis   Hinton   69             Childcare worker  us

###### A. Row count

In [19]:
df1.count()

id       78
fname    78
lname    78
age      78
prof     78
loc      78
dtype: int64

###### B. Each age group count

In [20]:
df2=df1.groupby(by="age")["age"].count()
df2

age
24    2
25    3
26    2
27    2
29    1
30    1
31    2
32    2
33    1
34    4
35    2
36    1
37    2
38    1
39    2
41    1
42    1
44    3
45    3
46    1
47    1
48    1
51    2
52    3
53    1
54    4
55    1
58    1
59    1
61    3
62    2
63    1
64    1
65    2
66    1
67    2
68    1
69    3
70    2
71    1
72    2
73    4
75    1
Name: age, dtype: int64

###### C. Each profession count [count desc]

In [21]:
df2=df1.groupby(by="prof")["prof"].count().sort_values(ascending=False)
df2

prof
Photographer                       5
Childcare worker                   4
Computer support specialist        4
Musician                           4
Loan officer                       4
Veterinarian                       3
Engineering technician             3
Statistician                       3
Recreation and fitness worker      3
Agricultural and food scientist    3
Real estate agent                  2
Police officer                     2
Pharmacist                         2
Nurse                              2
Lawyer                             2
Firefighter                        2
Actor                              2
Human resources assistant          2
Artist                             2
Dancer                             2
Athlete                            2
Civil engineer                     2
Electrician                        2
Politician                         1
Teacher                            1
Architect                          1
Social worker                      1
Secretary                          1
Psychologist                       1
Environmental scientist            1
Automotive mechanic                1
Carpenter                          1
Coach                              1
Designer                           1
Librarian                          1
Doctor                             1
Judge                              1
Economist                          1
Physicist                          1
Name: prof, dtype: int64

###### D. Civil engineer dept and age above 30

In [22]:
df2=df1.loc[(df1["prof"]=="Civil engineer")&(df1["age"]>30)]
df2

          id    fname   lname  age            prof loc
82   4000083     Faye  Sparks   61  Civil engineer  us
131  4000132  Jessica  Hester   72  Civil engineer  us